StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/axi/rtl8730aa_xmit.c
	txbd = dma_alloc_coherent(&pdev->dev, sizeof(struct tx_buf_desc) * entries, &dma, GFP_KERNEL);

	if (!txbd || (unsigned long)txbd & 0xFF) {
		RTW_INFO("Cannot allocate TXBD (q_idx = %d)\n", q_idx);
		return _FAIL;
	}

	_rtw_memset(txbd, 0, sizeof(struct tx_buf_desc) * entries);
	t_priv->tx_ring[q_idx].buf_desc = txbd;
	t_priv->tx_ring[q_idx].dma = dma;
	t_priv->tx_ring[q_idx].idx = 0;
	t_priv->tx_ring[q_idx].entries = entries;
	_rtw_init_queue(&t_priv->tx_ring[q_idx].queue);
	t_priv->tx_ring[q_idx].qlen = 0;

	RTW_INFO("%s queue:%d, ring_addr:0x%08x\n", __func__, q_idx, txbd);


	return _SUCCESS;
}

void rtl8730aa_free_txbd_ring(_adapter *padapter, unsigned int prio)
{
	struct xmit_priv *t_priv = &padapter->xmitpriv;
	struct dvobj_priv *pdvobjpriv = adapter_to_dvobj(padapter);
	struct platform_device *pdev = pdvobjpriv->pdev;
	struct rtw_tx_ring *ring = &t_priv->tx_ring[prio];
	u8 *txbd;
	struct xmit_buf	*pxmitbuf;
	dma_addr_t mapping;

	while (ring->qlen) {
		txbd = (u8 *)(&ring->buf_desc[ring->idx]);
		SET_TX_BD_OWN(txbd, 0);

		if (prio != BCN_QUEUE_INX) {
			ring->idx = (ring->idx + 1) % ring->entries;
		}

		pxmitbuf = rtl8730aa_dequeue_xmitbuf(ring);

		if (pxmitbuf) {
			mapping = GET_TX_BD_PHYSICAL_ADDR0_LOW(txbd);
			dma_unmap_single(&pdev->dev, mapping, pxmitbuf->len,
					 DMA_TO_DEVICE);

			rtw_free_xmitbuf(t_priv, pxmitbuf);

		} else {
			RTW_INFO("%s qlen=%d!=0,but have xmitbuf in pendingQ\n",
				 __func__, ring->qlen);
			break;
		}
	}

	dma_free_coherent(&pdev->dev, sizeof(struct tx_buf_desc) * ring->entries,
			  ring->buf_desc, ring->dma);
	ring->buf_desc = NULL;

}

/*
 * Draw a line to show queue status. For debug
 * i: queue index / W:HW index / h:host index / .: enpty entry / *:ready to DMA
 * Example:  R- 3- 4- 8 ..iW***h..... (i=3,W=4,h=8,
 * *** means 3 tx_desc is reaady to dma)
 */
#ifdef BUF_DESC_DEBUG
static void _draw_queue(PADAPTER Adapter, int prio)
{
	int i;
	u8 line[TX_BD_NUM_8730AA + 1];
	u16 hw, host;
	u32	index, tmp_4bytes = 0;

	struct xmit_priv	*t_priv = &Adapter->xmitpriv;
	struct rtw_tx_ring	*ring = &t_priv->tx_ring[prio];

	tmp_4bytes = rtw_read32(Adapter, get_txbd_rw_reg(prio));
	hw   = (u16)((tmp_4bytes >> 16) & 0x7ff);
	host = (u16)(tmp_4bytes & 0x7ff);

	index = ring->idx;
	_rtw_memset(line, '.', TX_BD_NUM_8730AA);

	/* ready to return to driver */
	if (index <= hw) {
		for (i = index; i < hw; i++) {
			line[i] = ':';
		}
	} else { /* wrap */
		for (i = index; i < TX_BD_NUM_8730AA; i++) {
			line[i] = ':';
		}
		for (i = 0; i < hw; i++) {
			line[i] = ':';
		}
	}

	/* ready to dma */
	if (hw <= host) {
		for (i = hw; i < host; i++) {
			line[i] = '*';
		}
	} else { /* wrap */
		for (i = hw; i < TX_BD_NUM_8730AA; i++) {
			line[i] = '*';
		}
		for (i = 0; i < host; i++) {
			line[i] = '*';
		}
	}

	line[index] = 'i'; /* software queue index */
	line[host] = 'h';  /* host index */
	line[hw] = 'W';	   /* hardware index */
	line[TX_BD_NUM_8730AA] = 0x0;

	/* Q2:10-20-30: */
	buf_desc_debug("Q%d:%02d-%02d-%02d %s\n", prio, index, hw, host, line);
}
#endif

/*
 * Read pointer is h/w descriptor index
 * Write pointer is host desciptor index: For tx side, if own bit is set in
 * packet index n, host pointer (write pointer) point to index n + 1.
 */
static u32 rtl8730aa_check_txdesc_closed(PADAPTER Adapter, u32 queue_idx,
		struct rtw_tx_ring *ring)
{
	/*
	 * hw_rp_cache is used to reduce REG access.
	 */
	u32	tmp32;

	/* bcn queue should not enter this function */
	if (queue_idx == BCN_QUEUE_INX) {
		return _TRUE;
	}

	/* qlen == 0 --> don't need to process */
	if (ring->qlen == 0) {
		return _FALSE;
	}

	/* sw_rp == hw_rp_cache --> sync hw_rp */
	if (ring->idx == ring->hw_rp_cache) {

		tmp32 = rtw_read32(Adapter, get_txbd_rw_reg(queue_idx));

		ring->hw_rp_cache = (tmp32 >> 16) & 0x0FFF;
	}

	/* check if need to handle TXOK */
	if (ring->idx == ring->hw_rp_cache) {
		return _FALSE;
	}

	return _TRUE;
}

#ifdef CONFIG_BCN_ICF
void rtl8730aa_tx_isr(PADAPTER Adapter, int prio)
{
	struct xmit_priv *t_priv = &Adapter->xmitpriv;
	struct dvobj_priv *pdvobjpriv = adapter_to_dvobj(Adapter);
	struct rtw_tx_ring *ring = &t_priv->tx_ring[prio];
	struct xmit_buf	*pxmitbuf;
	u8 *tx_desc;
	u16 tmp_4bytes;
	u16 desc_idx_hw = 0, desc_idx_host = 0;
	dma_addr_t mapping;

#ifdef CONFIG_LPS_LCLK
	int index;
	s32 enter32k = _SUCCESS;
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(Adapter);
#endif

	while (ring->qlen) {
		tx_desc = (u8 *)&ring->buf_desc[ring->idx];

		/*  beacon use cmd buf Never run into here */
		if (!rtl8730aa_check_txdesc_closed(Adapter, prio, ring)) {
			return;
		}

		buf_desc_debug("TX: %s, q_idx = %d, tx_bd = %04x, close [%04x] r_idx [%04x]\n",
			       __func__, prio, (u32)tx_desc, ring->idx,
			       (ring->idx + 1) % ring->entries);

		ring->idx = (ring->idx + 1) % ring->entries;
		pxmitbuf = rtl8730aa_dequeue_xmitbuf(ring);

		if (pxmitbuf) {
			mapping = GET_TX_BD_PHYSICAL_ADDR0_LOW(tx_desc);
			dma_unmap_single(pdvobjpriv->pdev, mapping,
					 pxmitbuf->len, DMA_TO_DEVICE);
			rtw_sctx_done(&pxmitbuf->sctx);
			rtw_free_xmitbuf(&(pxmitbuf->padapter->xmitpriv),
					 pxmitbuf);
		} else {
			RTW_INFO("%s qlen=%d!=0,but have xmitbuf in pendingQ\n",
				 __func__, ring->qlen);
		}
	}

#ifdef CONFIG_LPS_LCLK
	for (index = 0; index < HW_QUEUE_ENTRY; index++) {
		if (index != BCN_QUEUE_INX) {
			if (_rtw_queue_empty(&(Adapter->xmitpriv.tx_ring[index].queue)) == _FALSE) {
				enter32k = _FAIL;
				break;
			}
		}
	}
	if (enter32k) {
		_set_workitem(&(pwrpriv->dma_event));
	}
#endif

	if (check_tx_desc_resource(Adapter, prio)
	    && rtw_xmit_ac_blocked(Adapter) != _TRUE) {
		rtw_mi_xmit_tasklet_schedule(Adapter);
	}
}

#else /* !CONFIG_BCN_ICF */
void rtl8730aa_tx_isr(PADAPTER Adapter, int prio)
{
	struct xmit_priv *t_priv = &Adapter->xmitpriv;
	struct dvobj_priv *pdvobjpriv = adapter_to_dvobj(Adapter);
	struct rtw_tx_ring *ring = &t_priv->tx_ring[prio];
	struct xmit_buf	*pxmitbuf;
	u8 *tx_desc;
	u16 tmp_4bytes;
	u16 desc_idx_hw = 0, desc_idx_host = 0;
	dma_addr_t mapping;

#ifdef CONFIG_LPS_LCLK
	int index;
	s32 enter32k = _SUCCESS;
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(Adapter);
#endif

